Repository: wca/mbuffer
Catalog: po/*.po
Languages: de

source: warning:
de: Warnung:

source: error:
de: Fehler:

source: terminating...
de: beende...

source: summary: %Lu kB in %.1f sec - %.1f kB/sec average
de: gesamt: %Lu kB in %.1f Sek. - %.1f kB/Sek im Schnitt

source: catched INT signal...
de: INT Signal gefangen...

source: catched TERM signal...
de: TERM Signal gefangen

source: %8.1f kB/s in - %8.1f kB/s out - %Lu kB total - buffer %3.0f%% full
de: %8.1f kB/s rein - %8.1f kB/s raus - %Lu kB gesamt - Puffer %3.0f%% voll

source: statusThread: joining to terminate...
de: statusThread: warte auf das Ergebnis der Kinder

source: summary: %Lu kB in %.1f sec - %.1f kB/sec average
de: gesamt: %Lu kB in %.1f Sek - %.1f kB/Sek im Schnitt

source: requesting new volume for input
de: verlange neues Eingabemedium

source: requesting change of volume...
de: verlange Medienwechsel...

source: error executing mt to change volume in autoloader...
de: Fehler beim Ausführen von mt für den automatisierten Medienwechsel...

source: waiting for drive to get ready...
de: warte bis das Gerät bereit ist...

source: insert next volume and press return to continue...
de: Bitte nächstes Medium einlegen und RETURN drücken...

source: could not reopen input: %s
de: Konnte Eingabe nicht wieder öffnen: %s

source: OK - continuing...
de: OK - weiter gehts...

source: inputThread: starting...
de: inputThread: starte...

source: inputThread: error reading: %s
de: inputThread: fehler beim lesen: %s

source: inputThread: exiting...
de: inputThread: ende...

source: inputThread: last block has %i bytes
de: inputThread: letzter Block hat %i Bytes

source: inputThread: percentage reached - restarting output...
de: inputThread: Prozentsatz erreicht - fahre fort mit Ausgabe...

source: inputThread: exiting...
de: inputThread: beende...

source: End of volume, but not end of input: Output file must be given (option -o) for multi volume support!
de: Ende des Mediums - aber nicht der Eingabe: Ausgabedatei muß angegeben werden (Option -o) für Multimedien unterstützung!

source: volume full - insert new media and press return whe ready...
de: Medium voll - bitte neues Medium einlegen und RETURN drücken...

source: OK - continuing...
de: OK - fahre fort...

source: error reopening output file: %s
de: Fehler beim wiederöffnen der Ausgabedatei: %s

source: continuing with next volume
de: Weiter gehts mit dem nächsten Medium

source: resetting outputsize to normal
de: outputsize zurückgestzt auf normal

source: setting to new outputsize (end of device)
de: Setze outputsize neu (ende des Mediums)

source: outputThread: starting...
de: outputThread: starte...

source: outputThread: inputThread finished, %i blocks remaining
de: outputThread: inputThread fertig, %i Blöcke verbleiben

source: outputThread: finished - exiting...
de: outputThread: fertig - beende...

source: outputThread: last block has %i bytes
de: outputThread: letzter Block hat %i Bytes

source: outputThread: error writing: %s
de: outputThread: fehler beim schreiben: %s

source: creating socket for network input...
de: erzeuge socket für Netzwerkeingabe...

source: could not create socket for network input: %s
de: Konnte socket für Netzwerkeingabe nicht erzeugen: %s

source: resolving hostname of input interface...
de: Löse Hostnamen der Eingabeschnittstelle auf...

source: could not bind to socket for network input: %s
de: Konnte Verbindung zum Socket für Netzwerkeingabe nicht herstellen: %s

source: listening on socket...
de: Lausche auf Netzwerkeingang...

source: could not listen on socket for network input: %s
de: Konnte auf Netzwerkeingang nicht lauschen: %s

source: rejected connection from %s (%s)
de: Ferbindung von %s (%s) abgelehnt

source: rejected connection from %s
de: Verbindung von %s abgeleht

source: waiting to accept connection...
de: Warte auf Verbindung...

source: could not accept connection for network input: %s
de: Konnte Verbindung nicht aufbauen: %s

source: creating socket for network output...
de: Erzeuge socket für Netzwerkausgabe...

source: could not create socket for network output: %s
de: Konnte socket für Netzwerkausgabe nicht erzeugen: %s

source: resolving server host...
de: Löse Servernamen auf...

source: connecting to server (%x)...
de: baue Verbindung zu (%x) auf...

source: could not connect to server: %s
de: Konnte keine Verbindung zum Server herstellen: %s

source: unrecognized size charakter '%c' in option
de: Ungülitges Zeichen für die Größenordnung: '%c'

source: unrecognized argument "%s" for option "%s"
de: Unbekanntes Argument "%s" für Option "%s"

source: setting output size according to the blocksize of the device
de: Setze Ausgabegröße abhängig vom Ausgabegerät

source: cannot determine blocksize of device (unsupported by OS)
de: Konnte Blockgröße des Gerätes nicht herausfinden. (nicht unterstützt vom Betriebssystem)

source: argument for number of volumes must be > 0
de: Argument für die Anzahl der Medien muß > 0 sein

source: Network input set to %s:%hu
de: Netzwerk Eingabe auf %s:%hu gesetzt

source: error opening log file: %s
de: Fehler beim öffnen der Logbuchdatei: %s

source: logFile set to %s
de: logFile gesetzt auf %s

source: disabling display of status
de: Status informationen ausgeschaltet

source: unknown option "%s"
de: Unbekannte Option "%s"

source: inconsistent options: blocksize * number of blocks != totalsize!
de: Inkonsistente Optionen: Blockgröße * Anzahl(Blöcke) != Gesamtgröße!

source: maximum number of managable blocks is %Li Try a bigger blocksize!
de: Maximale Anzahl der verwaltbaren Blöcke ist %Li Versuchs mit einer größere Blockgröße!

source: Setting autoloader time without using a device doesn't make any sense!
de: Eine Autowechselzeit zu setzen ohne ein Gerät anzugeben macht keinen Sinn!

source: Setting both network input port and input file doesn't make sense!
de: Netzwerkeingabe und eine Eingabedatei zu setzen macht keinen Sinn!

source: Setting both network output and output file doesn't make sense!
de: Netzwerkausgabe und Ausgabedatei anzugeben macht keinen Sinn!

source: You need to set a network port for network input!
de: Du mußt einen Netzwerk port angeben für Netzwerk Eingabe!

source: When sending data to a server, both servername and port must be set!
de: Für die Netzwerkausgabe müssen Host und Port gesetzt sein!

source: multi volume support for input needs an explicit given input device (option -i)
de: Multi Medien Unterstützung benötigt die explizite Angabe eines Geräts (Option -i)

source: Could not allocate enough memory!
de: Nicht genügend Hauptspeicher allozierbar!

source: mapping temporary file to memory with %i blocks with %Lu byte (%Lu kB total)...
de: blende temporäre Datei mit %i Blöcken und %Lu Bytes in den Hauptspeicher (gesamt %Lu kB)

source: could not create temporary file (%s): %s
de: konnte temporäre Datei (%s) nicht anlegen: %s

source: could not resize temporary file: %s
de: Konnte Größe der temporären Datei nicht ändern: %s

source: could not map buffer-file to memory: %s
de: Konnte Pufferdatei nicht in den Hauptspeicher einblenden: %s

source: temporary file mapped to address %p
de: temporäre Datei auf Adresse %p eingeblendet

source: allocating memory for %i blocks with %Lu byte (%Lu kB total)...
de: alloziere Hauptspeicher für %i Blöcke mit %Lu Bytes (%Lu kB gesamt)...

source: creating semaphores...
de: erzeuge Semaphoren...

source: Error creating semaphore Buf2Dev: %s
de: Fehler beim Erzeugen der Semaphore Buf2Dev: %s

source: Error creating semaphore Dev2Buf: %s
de: Fehler beim Erzeugen der Semaphore Dev2Buf: %s

source: Error creating semaphore Percentage: %s
de: Fehler beim Erzeugen der Semaphore Percentage: %s

source: opening streams...
de: Öffne Verbindungen...

source: could not open input file: %s
de: Konnte Eingabedatei nicht öffnen: %s

source: could not open output file: %s
de: Konnte Ausgabedatei nicht öffnen: %s

source: checking output device...
de: Prüfe Ausgabegerät...

source: could not stat output: %s
de: Prüfung des Ausgabegeräts fehlgeschlagen: %s

source: blocksize is %i bytes on output device
de: Blockgröße ist %i Bytes auf dem Ausgabegerät

source: Blocksize should be a multiple of the blocksize of the output device (is %i)! This can cause problems with some device/OS combinations...
de: Die Blockgröße sollte ein vielfaches der des Ausgabegerätes sein (ist %i)! Dies kann zu Problemen mit einigen Geräte/Betriebssystem Kombinationen führen...

source: setting output blocksize to %i
de: Setze Ausgabeblockgröße auf %i

source: no device on output stream
de: Kein Gerät an der Ausgabe

source: Could not stat output device (unsupported by system)! This can result in incorrect written data when using multiple volumes. Continue at your own risc!
de: Konnte Ausgabegerät nicht analysieren (vom System aus nicht möglich)!Dies kann zu fehlerhaft geschriebenen Daten führen wenn mehrere Medien genutzt werden. Fortfahren auf eigene Gefahr!

source: accessing terminal...
de: Öffne Terminal...

source: could not open terminal: %s
de: Konnte Terminal nicht öffnen: %s

source: multi volume support turned off
de: Multi Medien Unterstützung abgeschaltet

source: registering signals...
de: registriere Signale...

source: error registering new SIGINT handler: %s
de: Fehler beim registrieren des Handlers für SIGINT: %s

source: starting threads...
de: starte Threads...
